//
// Created by LYM on 2018/11/11.
//
/**
 * 题目描述
给定任一个各位数字不完全相同的4位正整数，如果我们先把4个数字按非递增排序，再按非递减排序，然后用第1个数字减第2个数字，将得到
 一个新的数字。一直重复这样做，我们很快会停在有“数字黑洞”之称的6174，这个神奇的数字也叫Kaprekar常数。

 例如，我们从6767开始，将得到

 7766 - 6677 = 1089
 9810 - 0189 = 9621
 9621 - 1269 = 8352
 8532 - 2358 = 6174
 7641 - 1467 = 6174
 ... ...

 现给定任意4位正整数，请编写程序演示到达黑洞的过程。

输入描述:
输入给出一个(0, 10000)区间内的正整数N。


输出描述:
如果N的4位数字全相等，则在一行内输出“N - N = 0000”；否则将计算的每一步在一行内输出，直到6174作为差出现，输出格式见样例,每行中间没有空行。注意每个数字按4位数格
 式输出。

输入例子:
6767

输出例子:
7766 - 6677 = 1089
 9810 - 0189 = 9621
 9621 - 1269 = 8352
 8532 - 2358 = 6174
 */

/**
 * 思路：非法判断：如果输入的N每个位相等，那么一定可以被1111整除
 *  将N的各个位分解，排序，然后组合成被减数和减数，循环求结果，直到结果等于6174
 */
#include <stdio.h>

int num[4];
void sort();
int illegal(int N);
void deal(int n);

int main(void) {

    int N;
    int ans = 0;

    scanf("%d", &N);
    ans = N;
    if (illegal(N)) {
        printf("%d - %d = 0000", N, N);
    } else {
        do {
            deal(ans);
            sort();
            int a = num[3]*1000+num[2]*100+num[1]*10+num[0];
            int b = num[0]*1000+num[1]*100+num[2]*10+num[3];
            ans = a - b;
//            ans = 999*(num[3] - num[0]) + 90*(num[2] - num[1]);
            printf("%04d - %04d = %d\n", a, b, ans);
        } while (ans != 6174);
    }

    return 0;
}

void sort() {
    int i, j;
    for (i = 0; i < 4 - 1; i++) {
        for (j = 0; j < 4 - 1 - i; j++) {
            if (num[j] > num[j + 1]) {
                int tmp = num[j];
                num[j] = num[j + 1];
                num[j + 1] = tmp;
            }
        }
    }
}

int illegal(int N) {
    return (N%1111 == 0);
}

void deal(int n) {
    num[0] = n/1000;
    num[1] = n/100%10;
    num[2] = n%100/10;
    num[3] = n%10;
}